<?php

namespace App\Helper;

class Helper
{
    public static function randHash($strength = 20, $str = null)
    {
        $input = 'abcdefghij012345klmnopqrstuvwxyz6789ABCDEFGHIJKLMNOPQRSTUVWXYZ';
        $input = (is_null($str)) ? $input : $str;
        $input_length = strlen($input);
        $random_string = '';
        for ($i = 0; $i < $strength; $i++) {
            $random_character = $input[mt_rand(0, $input_length - 1)];
            if ($i == 0 && $random_character == "0")
                $random_character = 1;
            $random_string .= $random_character;
        }

        return $random_string;
    }
    public static function card()
    {
        $str = "0123456789";
        return SELF::randHash(4, $str) . '-' . SELF::randHash(4, $str) . '-****-' . SELF::randHash(4, $str);
    }
    public static function card2()
    {
        $str = "0123456789";
        return SELF::randHash(6, $str) . '*****' . SELF::randHash(4, $str);
    }
    public static function responseCode($number)
    {
        $err = [
            "0" => "‫شد‬ ‫انجام‬ ‫موفقیت‬ ‫با‬ ‫تراکنش‬",
            "11" => "‫است‬ ‫نامعتبر‬ ‫کارت‬ ‫شماره‬",
            "12" => "‫نیست‬ ‫کافی‬ ‫موجودی‬",
            "13" => "‫است‬ ‫نادرست‬ ‫رمز‬",
            "14" => "‫است‬ ‫مجاز‬ ‫حد‬ ‫از‬ ‫بیش‬ ‫رمز‬ ‫کردن‬ ‫وارد‬ ‫دفعات‬ ‫تعداد‬",
            "15" => "‫است‬ ‫نامعتبر‬ ‫کارت‬",
            "16" => "‫است‬ ‫مجاز‬ ‫حد‬ ‫از‬ ‫بیش‬ ‫وجه‬ ‫برداشت‬ ‫دفعات‬",
            "17" => "‫است‬ ‫شده‬ ‫منصرف‬ ‫تراکنش‬ ‫انجام‬ ‫از‬ ‫کاربر‬",
            "18" => "‫است‬ ‫گذشته‬ ‫کارت‬ ‫انقضای‬ ‫تاریخ‬",
            "19" => "‫است‬ ‫مجاز‬ ‫حد‬ ‫از‬ ‫بیش‬ ‫وجه‬ ‫برداشت‬ ‫مبلغ‬",
            "111" => "‫است‬ ‫نامعتبر‬ ‫کارت‬ ‫کننده‬ ‫صادر‬",
            "112" => "‫کارت‬ ‫کننده‬ ‫صادر‬ ‫سوییچ‬ ‫خطای‬",
            "113" => "‫نشد‬ ‫دریافت‬ ‫کارت‬ ‫کننده‬ ‫صادر‬ ‫از‬ ‫پاسخی‬",
            "114" => "‫نیست‬ ‫تراکنش‬ ‫این‬ ‫انجام‬ ‫به‬ ‫مجاز‬ ‫کارت‬ ‫دارنده‬",
            "21" => "‫است‬ ‫نامعتبر‬ ‫پذیرنده‬",
            "23" => "‫است‬ ‫داده‬ ‫رخ‬ ‫امنیتی‬ ‫خطای‬",
            "24" => "‫است‬ ‫نامعتبر‬ ‫پذیرنده‬ ‫کاربری‬ ‫اطالعات‬",
            "25" => "‫است‬ ‫نامعتبر‬ ‫مبلغ‬",
            "31" => "‫است‬ ‫نامعتبر‬ ‫پاسخ‬",
            "32" => "‫باشد‬ ‫نمی‬ ‫صحیح‬ ‫شده‬ ‫وارد‬ ‫اطالعات‬ ‫فرمت‬",
            "33" => "‫است‬ ‫نامعتبر‬ ‫حساب‬",
            "34" => "‫سیستمی‬ ‫خطای‬",
            "35" => "‫است‬ ‫نامعتبر‬ ‫تاریخ‬",
            "41" => "‫است‬ ‫تکراری‬ ‫درخواست‬ ‫شماره‬",
            "42" => "‫نشد‬ ‫یافت‬ ‫‪Sale‬‬ ‫تراکنش‬",
            "43" => "‫است‬ ‫شده‬ ‫داده‬ ‫‪Verify‬‬ ‫درخواست‬ قبلا",
            "44" => "‫نشد‬ ‫یافت‬ ‫‪Verfiy‬‬ ‫درخواست‬",
            "45" => "‫است‬ ‫شده‬ ‫‪Settle‬‬ ‫تراکنش‬",
            "46" => "‫است‬ ‫نشده‬ ‫‪Settle‬‬ ‫تراکنش‬",
            "47" => "‫نشد‬ ‫یافت‬ ‫‪Settle‬‬ ‫تراکنش‬",
            "48" => "‫است‬ ‫شده‬ ‫‪Reverse‬‬ ‫تراکنش‬",
            "412" => "‫است‬ ‫نادرست‬ ‫قبض‬ ‫شناسه‬",
            "413" => "‫است‬ ‫نادرست‬ ‫پرداخت‬ ‫شناسه‬",
            "414" => "‫است‬ ‫نامعتبر‬ ‫قبض‬ ‫کننده‬ ‫صادر‬ ‫سازمان‬",
            "415" => "‫است‬ ‫رسیده‬ ‫پایان‬ ‫به‬ ‫کاری‬ ‫جلسه‬ ‫زمان‬",
            "416" => "‫اطالعات‬ ‫ثبت‬ ‫در‬ ‫خطا‬",
            "417" => "‫است‬ ‫نامعتبر‬ ‫کننده‬ ‫پرداخت‬ ‫شناسه‬",
            "418" => "‫مشتری‬ ‫اطالعات‬ ‫تعریف‬ ‫در‬ ‫اشکال‬",
            "419" => "‫است‬ ‫گذشته‬ ‫مجاز‬ ‫حد‬ ‫از‬ ‫اطالعات‬ ‫ورود‬ ‫دفعات‬ ‫تعداد‬",
            "421" => "‫است‬ ‫نامعتبر‬ ‫‪IP‬‬",
            "51" => "‫است‬ ‫تکراری‬ ‫تراکنش‬",
            "54" => "‫نیست‬ ‫موجود‬ ‫مرجع‬ ‫تراکنش‬",
            "55" => "‫است‬ ‫نامعتبر‬ ‫تراکنش‬",
            "61" => "‫واریز‬ ‫در‬ ‫خطا‬"
        ];

        return isset($err[$number]) ? $err[$number] : "خطای ناشناخته";
    }
}
